---
title: InSessionViewSheetSet
classe: Autodesk.Revit.DB.InSessionViewSheetSet
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# InSessionViewSheetSet

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean IsAutomatic { get; set; }` | `inSessionViewSheetSet.IsAutomatic` | Boolean |
| `IReadOnlyList<View> OrderedViewList { get; set; }` | `inSessionViewSheetSet.OrderedViewList` | IReadOnlyList<View> |
| `ElementId SheetOrganizationId { get; set; }` | `inSessionViewSheetSet.SheetOrganizationId` | ElementId |
| `ElementId ViewOrganizationId { get; set; }` | `inSessionViewSheetSet.ViewOrganizationId` | ElementId |
| `ViewSet Views { get; set; }` | `inSessionViewSheetSet.Views` | ViewSet |
| `Void Dispose()` | `inSessionViewSheetSet.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```